In [2]:
pip install pandas

Requirement already satisfied: pandas in c:\users\user\anaconda3\envs\python\lib\site-packages (2.2.3)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: numpy>=1.22.4 in c:\users\user\anaconda3\envs\python\lib\site-packages (from pandas) (2.2.6)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\anaconda3\envs\python\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\user\anaconda3\envs\python\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\user\anaconda3\envs\python\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\user\anaconda3\envs\python\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [4]:
pip install numpy

Requirement already satisfied: numpy in c:\users\user\anaconda3\envs\python\lib\site-packages (2.2.6)
Note: you may need to restart the kernel to use updated packages.

In [5]:
import numpy as mp
import pandas as pd

In [6]:
obj = pd.Series([4, 7, -5, 3])

In [7]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [8]:
obj.values

array([ 4,  7, -5,  3])

In [9]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [10]:
obj.dtypes

dtype('int64')

In [11]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [12]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [13]:
sdata = {"조재성" : 163, "김석영" : 167, "조재경" : 162}

In [14]:
obj3 = pd.Series(sdata)

In [15]:
obj3

조재성    163
김석영    167
조재경    162
dtype: int64

In [16]:
obj3.name = "조재성패밀리"
obj3.index.name = "이름"

In [17]:
obj3

이름
조재성    163
김석영    167
조재경    162
Name: 조재성패밀리, dtype: int64

In [18]:
obj3.index = ['마누라', '남편', '동생']

In [19]:
obj3

마누라    163
남편     167
동생     162
Name: 조재성패밀리, dtype: int64

In [33]:
data = {"name" : ["Kilho", "Kilho", "Kilho", "Charles", "Charles"],
        "year" : [2014, 2015, 2016, 2015, 2016],
        "points" : [1.5, 1.7, 3.6, 2.4, 2.9]
       }
df = pd.DataFrame(data)

In [34]:
df

      name  year  points
0    Kilho  2014     1.5
1    Kilho  2015     1.7
2    Kilho  2016     3.6
3  Charles  2015     2.4
4  Charles  2016     2.9

In [24]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [25]:
df.columns

Index(['name', 'year', 'points'], dtype='object')

In [26]:
df.values

array([['Kilho', 2014, 1.5],
       ['Kilho', 2015, 1.7],
       ['Kilho', 2016, 3.6],
       ['Charles', 2015, 2.4],
       ['Charles', 2016, 2.9]], dtype=object)

In [27]:
df.index.name = "Num"
df.columns.name = "info"

In [28]:
df

info     name  year  points
Num
0       Kilho  2014     1.5
1       Kilho  2015     1.7
2       Kilho  2016     3.6
3     Charles  2015     2.4
4     Charles  2016     2.9

In [36]:
df2 = pd.DataFrame(data, columns = ["year", "name", "points", "Penalty_new"],
                         index = ["one", "two", "three", "four", "five"])

In [37]:
df2

       year     name  points Penalty_new
one    2014    Kilho     1.5         NaN
two    2015    Kilho     1.7         NaN
three  2016    Kilho     3.6         NaN
four   2015  Charles     2.4         NaN
five   2016  Charles     2.9         NaN

In [38]:
df2.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [39]:
df2.columns

Index(['year', 'name', 'points', 'Penalty_new'], dtype='object')

In [40]:
df2.values

array([[2014, 'Kilho', 1.5, nan],
       [2015, 'Kilho', 1.7, nan],
       [2016, 'Kilho', 3.6, nan],
       [2015, 'Charles', 2.4, nan],
       [2016, 'Charles', 2.9, nan]], dtype=object)

In [41]:
df2.describe()

             year    points
count     5.00000  5.000000
mean   2015.20000  2.420000
std       0.83666  0.864292
min    2014.00000  1.500000
25%    2015.00000  1.700000
50%    2015.00000  2.400000
75%    2016.00000  2.900000
max    2016.00000  3.600000

In [ ]:
df3 = pd.read_csv("./gap")